#include <stdio.h>
#include <stdlib.h>

//int checkData(int *p)
//{
//	int tmp[7] = { 0 }; //标记表，实际是哈希表的思路。一开始每个元素都是0。
//
//	int i;
//	for (i = 0; i < 5; i++)
//	{
//		if (tmp[p[i]]) //如果这个位置的标记已经是1，则代表重复，直接返回0。
//		{
//			return 0;
//		}
//		tmp[p[i]] = 1; //如果不是，则给这个位置标记为1。
//	}
//	return 1; //全部标记完毕也没有出现重复的情况，代表OK。
//}
//
//int main()
//{
//	int p[5]; //0 1 2 3 4分别代表a b c d e
//
//	for (p[0] = 1; p[0] <= 5; p[0]++)
//	{
//		for (p[1] = 1; p[1] <= 5; p[1]++)
//		{
//			for (p[2] = 1; p[2] <= 5; p[2]++)
//			{
//				for (p[3] = 1; p[3] <= 5; p[3]++)
//				{
//					for (p[4] = 1; p[4] <= 5; p[4]++) //五层循环遍历
//					{
//						//这里是五个人的描述，由于比较表达式只有0和1两个结果，如果要两个条件有且只有一个为真，则可以用比较表达式的值总和为1的方式直接判定。别忘了还要判定不能并列。
//						if ((p[1] == 2) + (p[0] == 3) == 1 && //B第二，我第三
//							(p[1] == 2) + (p[4] == 4) == 1 && //我第二，E第四
//							(p[2] == 1) + (p[3] == 2) == 1 && //我第一，D第二
//							(p[2] == 5) + (p[3] == 3) == 1 && //C最后，我第三
//							(p[4] == 4) + (p[0] == 1) == 1 && //我第四，A第一
//							checkData(p) //不能并列
//							)
//						{
//							for (int i = 0; i < 5; i++)
//							{
//								printf("%d ", p[i]);
//							}
//							putchar('\n');
//						}
//					}
//				}
//			}
//		}
//	}
//	system("pause");
//	return 0;
//}
/*
5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
A选手说：B第二，我第三；
B选手说：我第二，E第四；
C选手说：我第一，D第二；
D选手说：C最后，我第三；
E选手说：我第四，A第一；
比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
*/

//void bubbleSort(int arr[], int len) {
//	int i, j;
//	for (i = 0; i<len - 1; i++)
//	for (j = 0; j<len - 1 - i; j++) { 
//		if (arr[j] > arr[j + 1]) {
//			int tmp = arr[j];
//			arr[j] = arr[j + 1];
//			arr[j + 1] = tmp;
//		}
//	}
//}
//
////判断排名是否合理，不能重复
////有重复返回1，无重复返回0
//int isReason(int a[5]){
//	//不能改变排名
//	int b[5] = { 0 };
//	for (int i = 0; i < 5; i++){
//		b[i] = a[i];
//	}
//	//判断方法为先排序，在遍历一次
//	//如果直接遍历来查找是否重复需要两重循环
//	//可以采用高效的排序算法
//	bubbleSort(b, 5);
//	for (int i = 0; i < 4; i++){
//		if (b[i] == b[i + 1]){
//			return 1;
//		}
//	}
//	return 0;
//}
//
//int main(){
//	int rank[5] = { 0 };//排名，从0到4依次存放的是A到E的名次
//	for (rank[0] = 1; rank[0] <= 5; rank[0]++){
//		for (rank[1] = 1; rank[1] <= 5; rank[1]++){
//			for (rank[2] = 1; rank[2] <= 5; rank[2]++){
//				for (rank[3] = 1; rank[3] <= 5; rank[3]++){
//					for (rank[4] = 1; rank[4] <= 5; rank[4]++){ //五层循环遍历,依次改变名次
//						//五个人的描述，因为每个人只有一半是对的，所以就采用==1的方式判断
//						if ((rank[1] == 2) + (rank[0] == 3) == 1 && //B第二，我第三
//							(rank[1] == 2) + (rank[4] == 4) == 1 && //我第二，E第四
//							(rank[2] == 1) + (rank[3] == 2) == 1 && //我第一，D第二
//							(rank[2] == 5) + (rank[3] == 3) == 1 && //C最后，我第三
//							(rank[4] == 4) + (rank[0] == 1) == 1 && //我第四，A第一
//							isReason(rank) == 0 //是否合理
//							){
//							for (int i = 0; i < 5; i++){
//								printf("%d ", rank[i]);
//							}
//							printf("\n");
//						}
//						
//					}
//				}
//			}
//		}
//	}
//	system("pause");
//	return 0;
//}

//#define N 1e-4
// 核心思路就是去除一个 int 的最低地址对应的字节, 看看是高位还是低位
void isBigEnd() {
	int num = 0x11223344;
	int* p = &num;
	char* p2 = (char*)p;
	if (*p2 == 0x11) {
		printf("是大端\n");
		return;
	}
	printf("是小端\n");
	return;
	// 不建议大家写成缩成一行的版本. 不利于理解. 
	// return *((char*)(&num)) == 0x11;
}

int main(){
	//float a = 19.0;
	//float b = a / 7.0;
	//if (b * 7.0 == a) {
	//	printf("相等!\n");
	//} else {
	//	printf("不相等\n");
	//}
	//float a = 19.0;
	//float b = a / 7.0;
	//if (b * 7.0 - a < N && b * 7.0 - a > -N) {
	//	printf("相等, 此处不是严格相等, 而是允许误差\n");
	//} else {
	//	printf("不相等\n");
	//}
	//int a = 0x11223344;
	isBigEnd();
	system("pause");
	return 0;
}